// // Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

// // 14212 -> нет

// // 12821 -> да

// // 23432 -> да

// Console.Write ("Введите пятизначное число: ");
// string a= Console.ReadLine();
// char[] arr = {a[0], a[1], a[2], a[3], a[4] };

// // void PrintArray( char[] arr)
// // {   
// //     Console.Write("[");
// //     for(int i = 0; i < arr.Length; i++)
// //     {
// //         Console.Write($"{arr[i]}, ");
// //     }
// //     Console.Write("]");
// //     Console.WriteLine();
// // }
// // PrintArray(arr);
// if (a[0]==a[4] && a[1]==a[3])
// {
//     Console.WriteLine($"{a} -> да");
// }
// else
// {
//     Console.WriteLine($" {a} -> нет");
// }
